In [1]:
from sqlalchemy import create_engine
from sqlalchemy.engine import URL

server = r"HFTL-RA-0013\SQLEXPRESS03"
database = "expense_tracker"

connection_url = URL.create(
    "mssql+pyodbc",
    host=server,
    database=database,
    query={
        "driver": "ODBC Driver 17 for SQL Server",
        "Trusted_Connection": "yes"
    }
)

engine = create_engine(connection_url)

try:
    with engine.connect() as connection:
        print("Connection successful!")
except Exception as e:
    print("Connection failed:", e)

Connection successful!

In [2]:
import pandas as pd
df1 = pd.read_sql("SELECT * FROM daily_expenses", engine)
df1.tail(10)

      id expense_date  transport  food  data  other  total
32  3019   2026-01-23       14.0   0.0  12.0   70.0   96.0
33  3020   2026-01-24        0.0  40.0  12.0   50.0  102.0
34  3021   2026-01-25        0.0   0.0  12.0    0.0   12.0
35  3022   2026-01-26       23.0   0.0  12.0  260.0  295.0
36  3023   2026-01-27       12.0   0.0  12.0  420.0  444.0
37  3024   2026-01-28       23.0   5.0  12.0   25.0   65.0
38  3025   2026-01-29       25.0   0.0   6.0    5.0   36.0
39  3026   2026-01-30       20.0   0.0   6.0   20.0   46.0
40  3027   2026-01-31       40.0  10.0  12.0  250.0  312.0
41  3028   2026-02-01        0.0   0.0  12.0    5.0   17.0

In [8]:
import pandas as pd
df2 = pd.read_sql("SELECT * FROM daily_budget", engine)
df2.tail(10)

      id budget_date  budget_amount
32  3017  2026-01-23           30.0
33  3018  2026-01-24           20.0
34  3019  2026-01-25           20.0
35  3020  2026-01-26          300.0
36  3021  2026-01-27          400.0
37  3022  2026-01-28          200.0
38  3023  2026-01-29           50.0
39  3024  2026-01-30           50.0
40  3025  2026-01-31          300.0
41  3026  2026-02-01           20.0

In [5]:
pd.read_sql("SELECT * FROM weekly_budget", engine)

     id  week_start  money_available  weekly_budget  expected_income
0     1  2025-12-22            425.0          400.0            150.0
1     2  2025-12-29            350.0          241.0            300.0
2  1002  2026-01-05            400.0          150.0            200.0
3  2002  2026-01-12            300.0          500.0            500.0
4  3002  2026-01-19            300.0          130.0            200.0
5  3003  2026-01-26            800.0          500.0            200.0

In [6]:
import pandas as pd

tables = {
    "Daily_budget": "daily_budget",
    "weekly_budget": "weekly_budget",
    "daily_expenses": "daily_expenses"
}

with pd.ExcelWriter("expense_tracker_backup.xlsx", engine="openpyxl") as writer:
    for sheet, table in tables.items():
        df = pd.read_sql(f"SELECT * FROM {table}", engine)
        df.to_excel(writer, sheet_name=sheet, index=False)

print("Excel file created successfully")

Excel file created successfully